#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d880126e-28c8-4c16-912c-e477744a7777]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=60fb2f48-1710-4f6d-84fa-e3de325969fa]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=fa150b72-fdfc-4126-b025-04e9d0965993]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=02d2a3f3-1080-43ca-bcb0-0cde8b3b3174]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=aded100c-b585-4576-885e-762c67507c2f]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=736f1be5-f20d-4b6e-b5b1-502a9fddc306]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a73c6f7-0a33-4775-899a-9d0976d05b83]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e0ddcb68-4096-42e1-8fd5-2518504141ff]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6adff7c6-2b56-4487-81fe-9f971a811395]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=faf1f28b-4112-4dd2-9a26-c3cbc14a9e4e]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2a8ea77a-cf20-4da2-9409-ab12f7aad71a]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=85265bc8-746c-4278-b1d3-4dfcc44269e3]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=242f559a-5b9f-4351-abda-4aa1cd1ea96f]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b7c4055c-8f66-459f-94e4-cf51b597c772]
module.keycloak_dev.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=75a045b8-ddb1-4ef2-a6a7-aebfa758e5d1]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7f36873e-e532-4665-adfb-e67bef1bdfdd]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f3349e82-7a5a-402a-b0bb-85f6db647a48]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3d6cbd85-8fe9-4d4c-98b8-1ba6237f628e]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=45505140-54f5-43f1-bbfb-c344e7ba5c4f]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8e62bb06-8108-4787-94d5-7c9962bb3da3]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7475da75-fab8-4a74-a2f3-98cc61f59a44]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c03a9088-6387-4054-9aef-6958773c7ed2]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fff46c9b-2bd5-463c-af1d-56fe59f5b45d]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=656ea0c6-04d0-4953-a670-9482828b9b56]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c912cdfa-fc24-440e-ae83-f9d26f34277b]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5471293-c661-4e0b-a6f7-5520712c4392]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a486276e-2359-42aa-b7f5-624e9bbdaaac]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bd2afc16-a3a5-474a-8b47-2b30fbd6676f]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=889affb6-1e3a-4390-ba71-b0e0846dae0d]
module.keycloak_dev.module.onestopauth.module.client_test-2-1222.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aa5ac8b5-3611-4b64-8c48-7aedade1d43a]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=74c7c7f9-e7af-41e3-8186-b3d5e5e80639]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3fb093c0-f7d1-4ba1-987e-363814f65908]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f6b8061d-6338-43a5-a5b8-3719b5f0bc8e]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ddf77f5a-8101-4fca-aa54-6390449a7f03]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a7cffed4-f8d5-470b-9c6b-9c9c4e14ac55]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5f709164-1575-43d0-811b-d6aa4909d4d2]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=35d44640-1799-439a-a15f-a40a5c40ede2]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=09bf6d82-3a63-431c-8425-faf78176c2f3]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5a56abd2-3eaa-4d7a-8bcc-14e76ba8ef1b]
module.keycloak_dev.module.onestopauth.module.client_test-2-1222.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8faacb0-5bbf-4633-aaa5-94111ae14c40]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c2ac05dc-7383-4ddf-8d74-1d06576d5e94]
module.keycloak_dev.module.onestopauth.module.client_test-2-1222.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4d177901-f75e-4794-b285-ca7222176a00]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ee5a4ae5-3860-408c-9236-cb19c6cc85b1]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=68a2f533-ebae-4369-8773-e1a5d2a32306]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c656a565-256a-42a4-83af-5483011c4a68]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b3f2acc6-6b1e-4a3a-9f5d-4863f2e46681]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=78964452-06f5-4668-b095-fc1adc7c9e9f]
module.keycloak_dev.module.onestopauth.module.client_test-2-1222.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=471868f7-dc63-4ada-97ae-f2cafe0dcef9]
module.keycloak_dev.module.onestopauth.module.client_test-2-1222.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=067d3c89-aeac-45a9-9224-1122390805a6]
module.keycloak_dev.module.onestopauth.module.client_test-2-1222.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8ee44091-c89a-468b-a1f7-5593629ce4f3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-regression-1257"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-regression-1257.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-regression-1257"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-regression-1257"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-regression-1257"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-regression-1257.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-regression-1257"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-regression-1257"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-regression-1257"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-regression-1257.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-regression-1257"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-regression-1257"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1883 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*